life= 3
guardian=0

def end():
    print("                       ___                                            ")
    print("                      |-_-|                                           ")
    print("                  _   _|||_   _                                       ")
    print("                   \_/ _|_ \_/                                        ")
    print("                       |||                                            ")
    print("||                   _/   \_                                        ||")
    print("||                  _                                               ||")
    print("||                 / \                      (гоооооооооол)          ||")
    print("||-----------------\_/----------------------------------------------||")
    print("WIN!!!!!!!!!!!!")

def right(life, guardian):
    print(" ____________________________________________________________________________    ")
    print("                                         ___                                     ")
    print("  (Афигеть, как он прошел !!!??????)    |-_-|                                    ")
    print("                                        _|||_                                    ")
    print("                                      _/ _|_ \_                                  ")
    print("                                         |||                                     ")
    print("                                       _/   \_                                   ")
    print("                                               ___                               ")
    print("                                              |-_-|    (ТЫ)                      ")
    print("                                              _|||_                              ")
    print("                                            _/ _|_ \_   _                        ")
    print("                                               |||     / \                       ")
    print(" _____________________________________________/___\____\_/______________________ ")
    print("")
    print("Как же круто ты его обошел")
    print("")
    print("")
    print("")
    print("")
    if (guardian==3):
        print("Красава,", guardian,"защитник остался в шоке от твоего финта и ты забил гол")
        end()
    else:
        game(life,guardian)

def left(life, guardian):
    print(" ____________________________________________________________________________ ")
    print("                                                         ___                  ")
    print("                                                (ТЫ)    |-_-|                 ")
    print("                                                        _|||_                 ")
    print("                                                      _/ _|_ \_  _            ")
    print("                                                         |||    / \           ")
    print("                                                       _/   \_  \_/           ")
    print("                                               ___                            ")
    print("   (Афигеть, как он прошел !!!??????)         |-_-|                           ")
    print("                                              _|||_                           ")
    print("                                            _/ _|_ \_                         ")
    print("                                               |||                            ")
    print(" _____________________________________________/___\__________________________ ")
    print("")
    print("")
    print("")
    print("")
    if (guardian==3):
            print("Красава,", guardian,"защитник остался в шоке от твоего финта и ты забил гол")
            end()
    else:
        game(life,guardian)

def stepOne(life, guardian):
    life=life
    guardian=guardian
    firstStep = str(input(" Куда направишься чтобы обвести защитника???????? "))
    if (firstStep=="вправо"):
        print("Красава,", guardian,"защитник остался в шоке от твоего финта")
        
        guardian=guardian+1
        if (guardian==3):
            right(life, guardian)
            
        else:
            right(life, guardian)
    elif (firstStep == "влево"):
        life=life-1
        print("Не повезло, Защитник выбрался то же напрвление и поставил блок,  осталось жизней ",life)
        
        game(life, guardian)



def game(life, guardian):
    print(" ___________________________________________________________________________ ")
    print("                       ___                        ___                        ")
    print("              (ТЫ)    |-_-|          /\          |-_-|    (защитник)         ")
    print("                      _|||_          ||          _|||_                       ")
    print("                    _/ _|_ \_   _    ||        _/ _|_ \_                     ")
    print("                       |||     / \   ||           |||                        ")
    print("                     _/   \_   \_/   \/          _/ \_                       ")
    print(" __________________________________________________________________________ ")
    print("")
    print("")
    print("")
    print("")
    print("")
    
    if (life>=1):
        stepOne(life, guardian)
    else:
        print("Мне жаль но ты проиграл")




def main(life, guardian):
    print("                **    **  ********  **        **            **      ")
    print("               **    **  ********  **        **         **     **   ")
    print("              ********  **        **        **         **      **  ")
    print("             ********  ********  **        **         **      **  ")
    print("            **    **  **        **        **         **      **  ")
    print("           **    **  ********  ********  ********    **    **   ")
    print("          **    **  ********  ********  ********       **      ")

    print("Привет, это простая игра в футбол")
    print("Все просто!!! Ты игрок нападения, и тебе нужно обойти защитников. ")
    print("Защитники двигаются влево или вправо, ты доложен выбрать в какую сторону будешь обводить игрока.")
    print("Тебе нужно написать 'влево' или 'вправо', в ответ защитник  в какую сторону двинется он.")
    print("Если у тебя с защитником разные направления, то поздравляю ты прорвался, но если одинаковые, то теряется одна из трех жизней. ")
    print("Все просто!!!! Удачи)")
    
    game(life, guardian)


main(life, guardian)




